results/172.31.26.20:5000/2021-02-26-15-14-45/summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.31.26.20 (be patient)...INFO: POST header == 
---
POST /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d HTTP/1.0
Content-length: 31
Content-type: application/json
authorization: YaMtrXkKMTvxB8E4L8uW77YMcxSSL4KQ
Host: 172.31.26.20:5000
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:45 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:45 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:45 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:46 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
LOG: header received:
HTTP/1.0 200 OK
Server: gunicorn/20.0.4
Date: Fri, 26 Feb 2021 15:14:47 GMT
Connection: close
Content-Type: application/json
Content-Length: 39
Access-Control-Allow-Origin: *

[[{"confidence":100,"value":"other"}]]

LOG: Response code = 200
..done


Server Software:        gunicorn/20.0.4
Server Hostname:        172.31.26.20
Server Port:            5000

Document Path:          /api/nlp/v2/intent?userid=5f427f94a5c7f67b3985cc8d
Document Length:        39 bytes

Concurrency Level:      1
Time taken for tests:   2.014 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      6690 bytes
Total body sent:        8010
HTML transferred:       1170 bytes
Requests per second:    14.90 [#/sec] (mean)
Time per request:       67.129 [ms] (mean)
Time per request:       67.129 [ms] (mean, across all concurrent requests)
Transfer rate:          3.24 [Kbytes/sec] received
                        3.88 kb/s sent
                        7.13 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    47   67  33.2     50     161
Waiting:       47   67  33.2     50     161
Total:         48   67  33.4     50     161

Percentage of the requests served within a certain time (ms)
  50%     50
  66%     53
  75%     58
  80%    114
  90%    122
  95%    139
  98%    161
  99%    161
 100%    161 (longest request)